In [2]:
import pandas as pd

In [3]:
#small data for understanding

data={
    "name":["Farhana","Redu","Efah","Lina","Efah","Faiza"],
    "age":[27,27,12,25,12,20],
    "year":[2001,2001,2015,2000,2015,2003]
}

In [5]:
df=pd.DataFrame(data)
df

      name  age  year
0  Farhana   27  2001
1     Redu   27  2001
2     Efah   12  2015
3     Lina   25  2000
4     Efah   12  2015
5    Faiza   20  2003

In [6]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [47]:
df.shape

(6, 3)

In [7]:
df["Duplicate_data"]=df.duplicated()
df

      name  age  year  Duplicate_data
0  Farhana   27  2001           False
1     Redu   27  2001           False
2     Efah   12  2015           False
3     Lina   25  2000           False
4     Efah   12  2015            True
5    Faiza   20  2003           False

In [8]:
df.drop_duplicates(inplace=True)

In [51]:
df.shape

(5, 3)

In [9]:
# By using real data - sklearn

dataset=pd.read_csv("student_habits_performance.csv")
dataset.head(6)

,student_id,age,gender,study_hours_per_day,social_media_hours,netflix_hours,part_time_job,attendance_percentage,sleep_hours,diet_quality,exercise_frequency,parental_education_level,internet_quality,mental_health_rating,extracurricular_participation,exam_score
0,S1000,23,NaN,0.0,NaN,1.1,NaN,85.0,8.0,Fair,6,Master,Average,8,Yes,56.2
1,S1001,20,Female,6.9,2.8,2.3,No,97.3,4.6,Good,6,High School,NaN,8,No,100.0
2,S1002,21,Male,1.4,3.1,1.3,No,94.8,8.0,NaN,1,High School,Poor,1,NaN,34.3
3,S1003,23,Female,1.0,3.9,1.0,No,71.0,9.2,Poor,4,NaN,Good,1,Yes,26.8
4,S1004,19,Female,5.0,NaN,0.5,NaN,90.9,4.9,NaN,3,Master,NaN,1,No,66.4
5,S1005,24,Male,7.2,1.3,0.0,No,82.9,7.4,Fair,1,Master,Average,4,No,100.0

In [10]:
dataset.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1002     True
1003     True
1004     True
1005     True
1006     True
Length: 1007, dtype: bool

In [11]:
dataset.shape

(1007, 16)

In [12]:
dataset.drop_duplicates(inplace=True)

In [13]:
dataset.shape

(1000, 16)